InformationRegisters/ТК_ТБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ТБД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ТБД_Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ТБД_Периоды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ТБД/Ext/ManagerModule.bsl
Функция НеобходимоФормироватьЗадание(ТорговаяПлощадка,МассивТоваров)Экспорт
	
	Если МассивТоваров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаТБД = РегистрыСведений.ТК_ТБД_Периоды.ПериодТБД(ТорговаяПлощадка);
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Дата",ДатаТБД);
	Запрос.Параметры.Вставить("МассивТовары",МассивТоваров);
	Запрос.Параметры.Вставить("ТорговаяПлощадка",ТорговаяПлощадка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТК_ТБД.Номенклатура КАК Номенклатура,
	               |	ТК_ТБД.Количество КАК Количество
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	РегистрСведений.ТК_ТБД КАК ТК_ТБД
	               |ГДЕ
	               |	ТК_ТБД.Дата = &Дата
	               |	И ТК_ТБД.ТорговаяПлощадка = &ТорговаяПлощадка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	1 КАК сч
	               |ИЗ
	               |	Товары КАК Товары
	               |ГДЕ
	               |	Товары.Номенклатура В(&МассивТовары)";
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
